Revit 2024 API
ApplicationEntryPoint.CreateRibbonTab Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override void CreateRibbonTab(
	string tabName
)
Visual Basic
Public Overrides Sub CreateRibbonTab ( _
	tabName As String _
)
Visual C++
public:
virtual void CreateRibbonTab(
	String^ tabName
) override
Parameters
tabName
Type: System.String
See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace